{
    "spells": [
        {
            "id": 4,
            "spellName": "Aganazzar’s Scorcher",
            "spellLevel": 2,
            "spellSchool": "Evocation",
            "castingTime": "1 action",
            "concentration": false,
            "range": "30 feet",
            "components": ["V","S","M"],
            "materialComponents": "A red dragon's scale",
            "duration": "Instantaneous",
            "classes": "Sorcerer, Wizard",
            "ritual": false,
            "spellAttack": "DEX Save",
            "spellEffect": "Fire",
            "description": "A line of roaring flame 30 feet long and 5 feet wide emanates from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 3d8 fire damage on a failed save, or half as much damage on a successful one.",
            "higherLevels": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd."
        },
        {
            "id": 2,
            "spellName": "Burning Hands",
            "spellLevel": 1,
            "spellSchool": "Evocation",
            "castingTime": "1 action",
            "concentration": false,
            "range": "Self (15-foot cone)",
            "components": ["V","S"],
            "duration": "Instantaneous",
            "classes": "Sorcerer, Wizard",
            "ritual": false,
            "spellAttack": "DEX Save",
            "spellEffect": "Fire",
            "description": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one. The fire ignites any flammable objects in the area that aren't being worn or carried.",
            "higherLevels": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
        },
        {
            "id": 3,
            "spellName": "Find Familiar",
            "spellLevel": 1,
            "spellSchool": "Conjuration",
            "castingTime": "1 hour",
            "concentration": false,
            "range": "10 feet",
            "components": ["V","S","M"],
            "materialComponents": "10 gp worth of charcoal, incense, and herbs that must be consumed by fire in a brass brazier",
            "duration": "Instantaneous",
            "classes": "Wizard",
            "ritual": true,
            "spellAttack": "None",
            "spellEffect": "Summoning",
            "description": "You gain the service of a familiar, a spirit that takes an animal form you choose: bat, cat, crab, frog (toad), hawk, lizard, octopus, owl, poisonous snake, fish (quipper), rat, raven, sea horse, spider, or weasel. Appearing in an unoccupied space within range, the familiar has the Statistics of the chosen form, though it is a Celestial, fey, or fiend (your choice) instead of a beast.         Your familiar acts independently of you, but it always obeys your commands. In Combat, it rolls its own Initiative and acts on its own turn. A familiar can't Attack, but it can take other Actions as normal. When the familiar drops to 0 Hit Points, it disappears, leaving behind no physical form. It reappears after you cast this spell again. While your familiar is within 100 feet of you, you can communicate with it telepathically. Additionally, as an action, you can see through your familiar's eyes and hear what it hears until the start of your next turn, gaining the benefits of any Special Senses that the familiar has. During this time, you are deaf and blind with regard to your own Senses. As an action, you can temporarily dismiss your familiar. It disappears into a pocket dimension where it awaits your summons. Alternatively, you can dismiss it forever. As an action while it is temporarily dismissed, you can cause it to reappear in any unoccupied space within 30 feet of you. You can't have more than one familiar at a time. If you cast this spell while you already have a familiar, you instead cause it to adopt a new form. Choose one of the forms from the above list. Your familiar transforms into the chosen creature. Finally, when you Cast a Spell with a range of touch, your familiar can deliver the spell as if it had cast the spell. Your familiar must be within 100 feet of you, and it must use its Reaction to deliver the spell when you cast it. If the spell requires an Attack roll, you use your Attack modifier for the roll."     
        },
        {
            "id": 1,
            "spellName": "Firebolt",
            "spellLevel": 0,
            "spellSchool": "Evocation",
            "castingTime": "1 action",
            "concentration": false,
            "range": "120 feet",
            "components": ["V","S"],
            "duration": "Instantaneous",
            "classes": "Sorcerer, Wizard",
            "ritual": false,
            "spellAttack": "Ranged Spell Attack",
            "spellEffect": "Fire",
            "description": "You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn’t being worn or carried. This spell’s damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)."
        },
        {
            "id": 5,
            "spellName": "Fireball",
            "spellLevel": 3,
            "spellSchool": "Evocation",
            "castingTime": "1 action",
            "concentration": false,
            "range": "150 feet",
            "components": ["V","S","M"],
            "materialComponents": "A tiny ball of bat guano and sulfur",
            "duration": "Instantaneous",
            "classes": "Sorcerer, Wizard",
            "ritual": false,
            "spellAttack": "DEX Save",
            "spellEffect": "Fire",
            "description": "A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one. The fire spreads around corners. It ignites flammable objects in the area that aren’t being worn or carried.",
            "higherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd."
        },
        {
            "id": 6,
            "spellName": "Detect Magic",
            "spellLevel": 1,
            "spellSchool": "Divination",
            "castingTime": "1 action",
            "concentration": true,
            "range": "Self",
            "components": ["V","S"],
            "duration": "Concentration, Up to 10 minutes",
            "classes": "Bard, Cleric, Druid, Paladin, Ranger, Sorcerer, Wizard",
            "ritual": true,
            "spellAttack": "None",
            "spellEffect": "Detection",
            "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
        }
    ]
}